## Disfrutad :)

In [1]:
%matplotlib inline

import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

In [2]:
salaries_data = pd.read_csv('../data/salaries_data.csv')
test = pd.read_csv('../data/test.csv')

In [3]:
salaries_data.shape, test.shape

((500, 9), (107, 8))

In [4]:
todo = pd.concat([salaries_data, test], axis=0)

In [5]:
todo.shape

(607, 9)

In [6]:
todo.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,SE,FT,Data Engineer,140250.0,US,100,US,M
1,2022,SE,FT,Data Engineer,135000.0,US,100,US,M
2,2021,MI,FT,BI Data Analyst,100000.0,US,100,US,M
3,2021,MI,CT,ML Engineer,270000.0,US,100,US,L
4,2021,MI,FT,Data Engineer,26005.0,RO,0,US,L

In [7]:
todo.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 607 entries, 0 to 106
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           607 non-null    int64
 1   experience_level    607 non-null    object
 2   employment_type     607 non-null    object
 3   job_title           607 non-null    object
 4   salary_in_usd       500 non-null    float64
 5   employee_residence  607 non-null    object
 6   remote_ratio        607 non-null    int64
 7   company_location    607 non-null    object
 8   company_size        607 non-null    object
dtypes: float64(1), int64(2), object(6)
memory usage: 236.7 KB

In [8]:
todo.groupby('work_year').median().salary_in_usd

work_year
2020     79833.0
2021     82744.0
2022    120000.0
Name: salary_in_usd, dtype: float64

In [9]:
# label encoder custom
from sklearn.preprocessing import LabelEncoder

work_year={2020: 1, 2021: 3, 2022: 5} 


def cambio_work_year(x):   
    return work_year[x]    


todo.work_year=todo.work_year.apply(lambda x: work_year[x])

todo.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,5,SE,FT,Data Engineer,140250.0,US,100,US,M
1,5,SE,FT,Data Engineer,135000.0,US,100,US,M
2,3,MI,FT,BI Data Analyst,100000.0,US,100,US,M
3,3,MI,CT,ML Engineer,270000.0,US,100,US,L
4,3,MI,FT,Data Engineer,26005.0,RO,0,US,L

In [10]:
todo.groupby('experience_level').median().salary_in_usd

experience_level
EN     54742.0
EX    185989.5
MI     77161.0
SE    132320.0
Name: salary_in_usd, dtype: float64

In [11]:
# label encoder custom
from sklearn.preprocessing import LabelEncoder

experience_level={'EN': 1, 'MI': 4, 'SE': 15, 'EX':19} 


def cambio_experience_level(x):   
    return experience_level[x]    


todo.experience_level=todo.experience_level.apply(lambda x: experience_level[x])

todo.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,5,15,FT,Data Engineer,140250.0,US,100,US,M
1,5,15,FT,Data Engineer,135000.0,US,100,US,M
2,3,4,FT,BI Data Analyst,100000.0,US,100,US,M
3,3,4,CT,ML Engineer,270000.0,US,100,US,L
4,3,4,FT,Data Engineer,26005.0,RO,0,US,L

In [12]:
todo.groupby('employment_type').mean().salary_in_usd

employment_type
CT    222750.000000
FL     48000.000000
FT    113914.630165
PT     35053.375000
Name: salary_in_usd, dtype: float64

In [13]:
# label encoder custom

employment_type={'PT': 1, 'FL': 3, 'FT': 10, 'CT':19} 


def cambio_employment_type(x):   
    return employment_type[x]    


todo.employment_type=todo.employment_type.apply(lambda x: employment_type[x])


todo.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,5,15,10,Data Engineer,140250.0,US,100,US,M
1,5,15,10,Data Engineer,135000.0,US,100,US,M
2,3,4,10,BI Data Analyst,100000.0,US,100,US,M
3,3,4,19,ML Engineer,270000.0,US,100,US,L
4,3,4,10,Data Engineer,26005.0,RO,0,US,L

In [14]:
todo.groupby('company_size').mean().salary_in_usd

company_size
L    121031.375758
M    115805.494505
S     79242.435484
Name: salary_in_usd, dtype: float64

In [15]:
# label encoder custom

company_size={'S': 1, 'M': 24, 'L': 25} 


def cambio_employment_type(x):   
    return company_size[x]    


todo.company_size=todo.company_size.apply(lambda x: company_size[x])

todo.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,5,15,10,Data Engineer,140250.0,US,100,US,24
1,5,15,10,Data Engineer,135000.0,US,100,US,24
2,3,4,10,BI Data Analyst,100000.0,US,100,US,24
3,3,4,19,ML Engineer,270000.0,US,100,US,25
4,3,4,10,Data Engineer,26005.0,RO,0,US,25

In [16]:
todo=todo.drop(['employee_residence','remote_ratio'], axis=1)

In [17]:
todo.groupby('job_title').mean().salary_in_usd

job_title
3D Computer Vision Researcher                 5409.000000
AI Scientist                                 59410.600000
Analytics Engineer                          164900.000000
Applied Data Scientist                      175655.000000
Applied Machine Learning Scientist          178800.000000
BI Data Analyst                              82454.400000
Big Data Architect                           99703.000000
Big Data Engineer                            57080.571429
Business Data Analyst                        91253.500000
Cloud Data Engineer                         124647.000000
Computer Vision Engineer                     28226.750000
Computer Vision Software Engineer            70000.000000
Data Analyst                                 92154.555556
Data Analytics Engineer                      35000.000000
Data Analytics Lead                         405000.000000
Data Analytics Manager                      127134.285714
Data Architect                              175934.250000
Data Engineer                               111636.207207
Data Engineering Manager                    123227.200000
Data Science Consultant                      67874.200000
Data Science Engineer                        83705.000000
Data Science Manager                        158328.500000
Data Scientist                              110782.446281
Data Specialist                             165000.000000
Director of Data Engineering                156738.000000
Director of Data Science                    195074.000000
ETL Developer                                54957.000000
Finance Data Analyst                         61896.000000
Financial Data Analyst                      450000.000000
Head of Data                                142703.250000
Head of Data Science                        167000.000000
Head of Machine Learning                     79039.000000
Lead Data Analyst                            94804.500000
Lead Data Engineer                          139724.500000
Lead Data Scientist                         115190.000000
Lead Machine Learning Engineer               87932.000000
ML Engineer                                 117504.000000
Machine Learning Developer                   78791.000000
Machine Learning Engineer                   117583.129032
Machine Learning Infrastructure Engineer     54217.500000
Machine Learning Manager                    117104.000000
Machine Learning Scientist                  143900.000000
Marketing Data Analyst                       88654.000000
NLP Engineer                                          NaN
Principal Data Analyst                      170000.000000
Principal Data Engineer                               NaN
Principal Data Scientist                    214449.500000
Product Data Analyst                         20000.000000
Research Scientist                           99953.583333
Staff Data Scientist                        105000.000000
Name: salary_in_usd, dtype: float64

In [18]:
# label encoder custom

#def category(job_title):
    
#    titles = ['Engineer','Head','Lead','Director','Financial','Research', 'Architect','Principal','Developer',
#              'Research','Specialist']
    
#    for title in titles: 
#        if job_title.find(title) >= 0:
            
#            return title 
    
#    return 'other'

#todo['job_title'] = todo['job_title'].apply(category)

todo.job_title=LabelEncoder().fit_transform(todo.job_title)

todo.head()

#todo.groupby('job_title').mean().salary_in_usd

,work_year,experience_level,employment_type,job_title,salary_in_usd,company_location,company_size
0,5,15,10,17,140250.0,US,24
1,5,15,10,17,135000.0,US,24
2,3,4,10,5,100000.0,US,24
3,3,4,19,36,270000.0,US,25
4,3,4,10,17,26005.0,US,25

In [19]:
#todo.groupby('company_location').median().salary_in_usd

def cat_location(company_location):
    
    if company_location == 'US':
        return 'nivel1'
    elif company_location == 'NZ':
        return 'nivel2'
    elif company_location in ['CA','CN','AE','DZ']:
        return 'nivel3'
    elif company_location in ['SG','DK','JP','BE','DE']:
        return 'nivel4'
    elif company_location in ['GB','AT','PL','IE']:
        return 'nivel5'
    elif company_location in ['CZ','FR','CH','SI','RO']:
        return 'nivel6'
    elif company_location in ['NL','GR','ES']:
        return 'nivel7'
    elif company_location in ['PT','LU','CL']:
        return 'nivel8'
    elif company_location in ['HU','EE','IN','NG']:
        return 'nivel9'
    elif company_location in ['MT','BR','TR','HN']:
        return 'nivel10'
    elif company_location in ['AS','MD','UA','PK']:
        return 'nivel11'
    else:
        return 'other'

todo['company_location'] = todo['company_location'].apply(cat_location)

In [20]:
# Your code here
# label encoder custom

company_location={'nivel1': 13, 'nivel2': 11, 'nivel3': 10, 'nivel4': 9, 'nivel5': 8, 'nivel6': 7,
                 'nivel7': 6, 'nivel8': 5, 'nivel9': 4, 'nivel10': 3, 'nivel11': 2, 'other': 1} 


def cambio_company_location(x):   
    return company_location[x]    


todo.company_location=todo.company_location.apply(lambda x: company_location[x])

todo.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,company_location,company_size
0,5,15,10,17,140250.0,13,24
1,5,15,10,17,135000.0,13,24
2,3,4,10,5,100000.0,13,24
3,3,4,19,36,270000.0,13,25
4,3,4,10,17,26005.0,13,25

In [21]:
salaries_data=todo[:500]

In [22]:
salaries_data.shape

(500, 7)

In [23]:
test=todo[500:].drop(['salary_in_usd'], axis=1)

In [24]:
test.shape

(107, 6)

In [25]:
from sklearn.model_selection import train_test_split as tts


X=salaries_data.drop(['salary_in_usd'], axis=1)
y=salaries_data['salary_in_usd']

In [26]:
X_train, X_test, y_train, y_test = tts(X, y, train_size=0.9, test_size=0.1, random_state=42)

X_train.shape, X_test.shape, y_train.shape, y_test.shape

((450, 6), (50, 6), (450,), (50,))

In [27]:
from sklearn.linear_model import LinearRegression as Ridge
ridge=Ridge()
ridge.fit(X_train, y_train)
ridge.predict(X_test)[:10]

array([151073.86409503,  89421.15018827, 127095.72869524, 144623.6098257 ,
       144623.6098257 ,  79157.52005581, 113771.46467533, 148959.13203962,
       112972.7784553 ,  62669.02789203])

In [28]:
from sklearn.metrics import r2_score as r2
y_pred_ridge=ridge.predict(X_test)
r2(y_test, y_pred_ridge)

0.45627964380339203

In [29]:
y_pred_ridge=ridge.predict(X_train)
r2(y_train, y_pred_ridge)

0.46595431231822537

In [30]:
from sklearn.metrics import mean_absolute_error as mae
y_pred_ridge=ridge.predict(X_test)
mae(y_test, y_pred_ridge)

29521.94074146534

In [31]:
#prediccion sobre los datos de test

y_pred_ridge=ridge.predict(test)
len(y_pred_ridge)

107

In [32]:
#index_lst = [i for i in range(107)]

#sample= pd.DataFrame({"id" : index_lst, "salary_in_usd" : y_pred_ridge})
#sample.to_csv("../data/sample.csv", index=False)